//******************************************************************************
// Имя файла    :  'GPIO.h'
// заголовок    :  Драйвер портов ввода-вывода (F4)
// Автор        :  Маньянов Р.Р.
// Контакты     :  manianov.rus@gmail.com
// Дата         :  25.07.2015
//******************************************************************************

#ifndef __GPIO_H
#define __GPIO_H

#include "stm32F4xx.h" 

//==============================================================================
//                  Структуры и типы
//==============================================================================

    // Структура пина ввода-вывода
    typedef struct GPIO
    {
        GPIO_TypeDef*       port;       // порт         
        uint32_t            rcc;        // источник тактирования порта  
        GPIO_InitTypeDef    definition;
        uint16_t            pinSource;  // пин сорс
        uint8_t             altFunc;    // альтернативная функция пина    
    } sGpio;

 
//==============================================================================
//                      Прототипы функций
//==============================================================================

    // инициализация пина
    void GPIOInit (sGpio* gpio);

    // установка на пине единицы
    void GPIOSet (sGpio* gpio);

    // установка на пине нуля
    void GPIOReset (sGpio* gpio);

    // переключение состояния пина
    void GPIOToggle (sGpio* gpio);    
    
    // установка на пине значения 
    void GPIOWrite (uint8_t value, sGpio* gpio);    
    
    // чтение значения входа пина
    uint8_t GPIOReadIn (sGpio* gpio);    
    
    // чтение значения выхода пина
    uint8_t GPIOReadOut (sGpio* gpio);

#endif //__GPIO_H








