#ifndef IMODBUS_RTU_CRC_H_
#define IMODBUS_RTU_CRC_H_

#include "stdint.h"

typedef enum 
{
    CRC_ERROR = 0,
    CRC_OK = 1,
}CRC_RESULT_t;
class IModbusRTU_CRC
{
public:
    //==============================================================================
    //                          Проверка CRC16     
    //------------------------------------------------------------------------------
    // buffer           - принятый пакет
    // buffer_size     - размер пакета
    // \return          1 - CRC верен
    //==============================================================================
    virtual CRC_RESULT_t check_crc( uint8_t * buffer, int buffer_size ) = 0;
    //==============================================================================
    //                          Расчёт CRC16     
    //------------------------------------------------------------------------------
    // buffer           - принятый пакет
    // buffer_size     - размер пакетаы
    // \return          - расчитанный CRC
    //==============================================================================
    virtual uint16_t get_crc( uint8_t * buffer, int buffer_size ) = 0;
};



#endif