//******************************************************************************
// Имя файла    :  'GPIO.h'
// заголовок    :  Драйвер портов ввода-вывода (F1)
// Автор        :  Маньянов Р.Р.
// Контакты     :  manianov.rus@gmail.com
// Дата         :  25.07.2015
//******************************************************************************

#ifndef __GPIO_H
#define __GPIO_H

#include "stm32F10x.h" 

//==============================================================================
//                  Структуры и типы
//==============================================================================

    // Структура пина ввода-вывода
    typedef struct GPIO
    {
        GPIO_TypeDef*       port;       // порт 
        uint32_t            rcc;        // источник тактирования порта   
        GPIO_InitTypeDef    definitions;  
        uint32_t            remap;      // ремап
    } sGpio;

//==============================================================================
//                      Прототипы функций
//==============================================================================

    // инициализация пина
    void GPIOInit (sGpio* gpio);

    // установка на пине единицы
    extern inline void GPIOSet (sGpio* gpio);

    // установка на пине нуля
    extern inline void GPIOReset (sGpio* gpio);

    // переключение состояния пина
    extern inline void GPIOToggle (sGpio* gpio);    
    
    // установка на пине значения 
    extern inline void GPIOWrite (uint8_t value, sGpio* gpio);    
    
    // чтение значения входа пина
    extern inline uint8_t GPIOReadIn (sGpio* gpio);    
    
    // чтение значения выхода пина
    extern inline uint8_t GPIOReadOut (sGpio* gpio);

#endif //__GPIO_H








